config/cf/Catalogs/ШаблоныОтветовКомментариевВЗаданиях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ШаблоныОтветовКомментариевВЗаданиях</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонОповещения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидимостьШаблона</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидимостьШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецШаблона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Enums/ВидимостьШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидимостьШаблонов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Личный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппыПользователей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Catalogs/ШаблоныОтветовКомментариевВЗаданиях/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Ошибки = Неопределено;
	
	Если ВидимостьШаблона = Перечисления.ВидимостьШаблонов.ГруппыПользователей Тогда
		Если НЕ ЗначениеЗаполнено(ВладелецШаблона) 
			ИЛИ ТипЗнч(ВладелецШаблона) <> Тип("СправочникСсылка.ГруппыПользователей") Тогда
			
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
				"Объект.ВладелецШаблона",
				НСтр("ru = 'Не заполнен вледелец шаблона.'"),
				"");
				
		КонецЕсли;
	КонецЕсли;
	
	Если ВидимостьШаблона = Перечисления.ВидимостьШаблонов.Личный Тогда
		Если НЕ ЗначениеЗаполнено(ВладелецШаблона) 
			ИЛИ ТипЗнч(ВладелецШаблона) <> Тип("СправочникСсылка.Пользователи") Тогда
			
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
				"Объект.ВладелецШаблона",
				НСтр("ru = 'Не заполнен вледелец шаблона.'"),
				"");
				
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
